{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_filter": 24, "dim_ordering": "tf", "b_regularizer": null, "input_dtype": "float32", "trainable": true, "nb_col": 5, "batch_input_shape": [null, 64, 64, 3], "nb_row": 5, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "nb_col": 5, "name": "convolution2d_2", "nb_row": 5, "W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "border_mode": "same", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "nb_col": 3, "name": "convolution2d_3", "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "nb_col": 3, "name": "convolution2d_4", "nb_row": 3, "W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 1024, "b_regularizer": null, "trainable": true, "output_dim": 1164, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"input_dim": 1164, "b_regularizer": null, "trainable": true, "output_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"input_dim": 100, "b_regularizer": null, "trainable": true, "output_dim": 50, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"input_dim": 50, "b_regularizer": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "bias": true}}], "keras_version": "1.2.1"}